[
    {
      "title": "HP Inc.",
      "subtitle": "Software Applications Engineer - AI Platform & Developer Experience Engineer",
      "time": "Feb 2025 - Present",
      "description": "Earned HP Innovator Award for RAG graph architectures; evaluated productivity impacts of GenAI coding-assistant fine-tuned models to inform licensing strategy; delivered MCP-based developer platforms enabling secure enterprise-context delivery; supported GitHub Enterprise platforms serving 10,000+ engineers; designed scalable retrieval pipelines using vector DBs and enterprise authorization models; rewrote an MCP server from Python into production-grade Golang with Double-PKCE auth."
    },
    {
      "title": "HP Inc.",
      "subtitle": "Software AI Intern",
      "time": "Jun 2024 - Jan 2025",
      "description": "Led evaluations of AI coding tools via automated assessment pipelines and enterprise datasets; performed hallucination and security analyses; supported enterprise developer platforms, portals, and knowledge systems."
    },
    {
      "title": "Tigard High School Technology Team",
      "subtitle": "FTC 3965 - Lead Programmer",
      "time": "2015 - 2018",
      "image": "./images/ftc.jpeg",
      "description": "Robotics set me on the path to becoming a software engineer. I learned so much about programming, engineering, and teamwork. I was the lead programmer for the team for 4 years and I loved every minute of it. I am so grateful for the experience and guidance from my mentors and teachers. I look forward to mentoring a team someday in the future."
    },
    {
      "title": "International Collegiate Programming Contest",
      "link": "",
      "description": "I love competitive programming. It is a fun way to enhance skills in a collaborative and competitive environment. I have competed in the ICPC twice and I look forward to competing again."
    },
    {
      "title": "OSU's ACM Chapter",
      "time": "Fall 2019 - Present",
      "description": "The ACM has been a great way to network with other students, develop my skills, and find new opportunities. I have been a member since my first year at OSU and I enjoy the supportive environment."
    },
    {
      "title": "App Development Club",
      "time": "Spring 2023 - Present",
      "description": "The App Dev club at OSU has been a great way to network with other students."
    }
]
  